ziyiz/DIY-Sim-Racing-FFB-Pedal-Customed/ESP32_master/src/Main.cpp
      }
      if (pedal_status==2)
      {
        SetControllerOutputValueAccelerator(0);
        SetControllerOutputValueBrake(0);
        SetControllerOutputValueThrottle(0);
        SetControllerOutputValueRudder((int16_t)(0.5*JOYSTICK_RANGE));
        //int16_t filter_brake=0;
        //int16_t filter_throttle=0;
        
        SetControllerOutputValueRudder_brake(pedal_brake_value,pedal_throttle_value);
        
      }
      

      joystickSendState();
    }
    #endif
    // set analog value
    #ifdef Using_analog_output

      dacWrite(Analog_brk,(uint16_t)((float)((Joystick_value[1])/(float)(JOYSTICK_RANGE))*255));
      dacWrite(Analog_gas,(uint16_t)((float)((Joystick_value[2])/(float)(JOYSTICK_RANGE))*255));
    #endif
    //set MCP4728 analog value
    #ifdef Using_MCP4728
      if(MCP_status)
      {
        mcp.setChannelValue(MCP4728_CHANNEL_A, (uint16_t)((float)Joystick_value[0]/(float)JOYSTICK_RANGE*0.8f*4096));
        mcp.setChannelValue(MCP4728_CHANNEL_B, (uint16_t)((float)Joystick_value[1]/(float)JOYSTICK_RANGE*0.8f*4096));
        mcp.setChannelValue(MCP4728_CHANNEL_C, (uint16_t)((float)Joystick_value[2]/(float)JOYSTICK_RANGE*0.8f*4096));
      }

    #endif
      delay(2);
  }
}

//LED task
uint8_t LED_bright_index=0;
uint8_t LED_bright_direction=1;
void LED_Task( void * pvParameters)
{
  for(;;)
  {
    #ifdef LED_ENABLE_WAVESHARE
    //LED status update
      if(LED_bright_index>30)
      {
        LED_bright_direction=-1;
      }
      if(LED_bright_index<2)
      {
        LED_bright_direction=1;
      }
      LED_bright_index=LED_bright_index+LED_bright_direction;
      pixels.setBrightness(LED_bright_index);
      uint8_t led_status=dap_bridge_state_st.payloadBridgeState_.Pedal_availability[0]+dap_bridge_state_st.payloadBridgeState_.Pedal_availability[1]*2+dap_bridge_state_st.payloadBridgeState_.Pedal_availability[2]*4;
      switch (led_status)
      {
        case 0:
          //pixels.setPixelColor(0,0xff,0xff,0xff);
          pixels.setPixelColor(0,0x52,0x00,0xff);//Orange
          pixels.show();
          break;
        case 1:
          pixels.setPixelColor(0,0xff,0x00,0x00);//Red
          pixels.show();
          break;
        case 2:
          pixels.setPixelColor(0,0xff,0x0f,0x00);//Orange
          pixels.show();
          break;
        case 3:
          pixels.setPixelColor(0,0x52,0x00,0xff);//Cyan
          pixels.show();
          break; 
        case 4:
          pixels.setPixelColor(0,0x5f,0x5f,0x00);//Yellow
          pixels.show();
          break;
        case 5:
          pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
          pixels.show();
          break;      
        case 6:
          pixels.setPixelColor(0,0x00,0xff,0x00);//Green
          pixels.show();
          break;  
        case 7:
          pixels.setPixelColor(0, 0x80, 0x00, 0x80);//Purple
          pixels.show();
          break;                                         
        default:
          break;
      }
      delay(150);   
    #endif  
  }
}


/**********************************************************************************************/
/*                                                                                            */
/*                         pedal update task                                                  */
/*                                                                                            */
/**********************************************************************************************/


//long lastCallTime = micros();
unsigned long cycleTimeLastCall = micros();
unsigned long minCyclesForFirToInit = 1000;
unsigned long firCycleIncrementer = 0;

float filteredReading_exp_filter = 0;
unsigned long printCycleCounter = 0;





  








/**********************************************************************************************/
/*                                                                                            */
/*                         communication task                                                 */
/*                                                                                            */
/**********************************************************************************************/












